#### DirectShapeReferenceOptions Members

---

|  |
| --- |
| DirectShapeReferenceOptions Class   Constructors   Methods   Properties   See Also |

The  DirectShapeReferenceOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DirectShapeReferenceOptions | Constructs a new DirectShapeRefOptions instance with default settings. |
| Public method | DirectShapeReferenceOptions(DirectShapeReferenceOptions) | Constructs a new copy of the input DirectShapeRefOptions object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DirectShapeReferenceOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidReferenceName | Validates that the input name can be assigned to a direct shape reference. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters. |

# See Also

DirectShapeReferenceOptions Class

Autodesk.Revit.DB Namespace